<?php

namespace app\api\controller;

use app\api\library\buiapi\Api;
use think\Db;

class GameGame extends Api
{

    protected $model = null;

    protected $noNeedRight = '*';
    protected $noNeedLogin = ['draw_all_list'];
    protected $_allow_func = ['index', 'add', 'edit', 'view', 'ph', 'record_coupon', 'draw_list','draw_all_list'];


    use \app\api\library\buiapi\traits\Api;

    public function _initialize()
    {
        parent::_initialize();
        $this->model = new \app\api\model\GameGame;
    }


    //等级排行
    public function ph()
    {
        // $r = \app\api\model\User::Order('game_level', 'desc')->field('id,level,game_level,username')->limit(0, 100)->select();
        $r = db('user')
            ->order('game_level', 'desc')
            ->field('id,game_level,username')
            ->limit(0, 100)
            ->select();
        $this->success('', $r);
        $this->success('', $r);
    }

    /**
     * 公共方法-列表
     */
    public function index()
    {
        $this->relationSearch = true;
        $this->request->filter('trim,strip_tags,xss_clean');
        list($where, $sort, $order, $offset, $limit) = $this->buildparams();
        $mixWhere = $this->buildwheres(implode(',', $this->_search_field));
        $item = $this->model->where($where)->where($this->_init_where)->where($mixWhere)->order($sort, $order);
        if (!empty($this->_index_field)) {
            $item->field($this->_index_field);
        }

        $game_level = $this->auth->getUser()['game_level'];
        $cnfig = \app\api\model\GameLevel::where('name', $game_level)->find();
        if (!$cnfig) {
            $this->error('等级不符合参与条件');
        }


        $list = $this->__handle_index__($item->paginate($limit));
        foreach ($list['rows'] as $k => $dat) {
            $list['rows'][$k]['bai'] = \app\api\model\UserGame::where('game_game_id', $dat['id'])->where('user_id',$this->auth->id)->where('status', 1)->find();
            $list['rows'][$k]['config'] = $cnfig;
        }
        $this->success('数据列表', $list);
    }

    public function record_coupon()
    {
        $user_id = $this->auth->id;
        $list = \app\api\model\UserMoneyLog::where('user_id', $user_id)
            ->field('id,money,memo,createtime')
            ->whereIn('type', ['coupon','neixuquan'])
            ->order('createtime desc')
            ->paginate(10, false, ['query' => request()->param()]);
        $this->success('ok', $list);
    }


    public function draw_list()
    {
        $user_id = $this->auth->id;
        $list = \app\api\model\LotteryRecord::where('user_id', $user_id)
            ->where('createtime','between',[strtotime('2024-11-12 00:00:00'),strtotime('2024-12-30 23:59:59')])
            ->field('id,lottery_type,price,memo,createtime')
            ->order('createtime desc')
            ->paginate(10, false, ['query' => request()->param()]);
        foreach ($list as $key => $value) {
            $list[$key]['lottery_type'] = $value['memo'] ? $value['memo'] : $this->get_lottery_typename($value['lottery_type']);
            $list[$key]['createtime'] = date('Y-m-d H:i', $value['createtime']);
        }
        $this->success('ok', $list);
    }

    public function draw_all_list()
    {
        $params = $this->request->request('', '', 'trim,xss_clean,strip_tags');
        $params['page'] = isset($params['page']) ? $params['page'] : 1;
        $lottery_id = isset($params['id']) ? $params['id'] : 4;
        $list = \app\api\model\LotteryRecord::where('createtime','between',[strtotime('2024-11-12 00:00:00'),strtotime('2024-12-30 23:59:59')])
            ->field('id,lottery_type,memo,price,user_id,createtime')
            ->order('createtime DESC')->limit($params['page'] - 1,5)->select();
        $luck_list = $this->_get_luck_list($lottery_id);
        shuffle($luck_list);
        foreach ($list as $key => $value) {
            if($value != null){
                $phone = \app\api\model\User::where('id', $value['user_id'])->field('username')->find();
                $list[$key]['phone'] = $this->hide_phone_number($phone['username']);
                $list[$key]['lottery_type'] = $this->get_lottery_typename($value['lottery_type']);
                $list[$key]['createtime'] = date('Y-m-d H:i', $value['createtime']);
                $list[$key]['desc'] = '恭喜用户'.$list[$key]['phone'].'抽中'. $value['memo'];
            }
        }
        $luck = array('id'=>rand(10000,9999),'lottery_type'=>'现金奖','phone'=>'156****1984','createtime'=>date('Y-m-d H:i'),'desc'=>'恭喜用户'.$luck_list[0],'user_id'=>rand(10000,9999));
        array_push($list,$luck);
        shuffle($list);
        $this->success('ok', $list);
    }

    public function hide_phone_number($phone_number) {
        return substr_replace($phone_number, '****', 3, 4);
    }

    public function get_lottery_typename($type){
        if ($type == 1){
            return '消费券';
        } elseif ($type == 2){
            return '商城经验';
        }elseif ($type == 3){
            return '项目收益';
        }elseif ($type == 4){
            return '现金奖';
        }elseif ($type == 5){
            return '实物奖';
        }

    }

    static function _get_luck_list($id)
    {
        $list = array();
        switch ($id){
            case 4:
                $list = array(
                    '158****8339	抽中抽奖现金红包89514元',
                    '136****4200	抽中抽奖现金红包66651元',
                    '138****5565	抽中抽奖现金红包89876元',
                    '158****3787	抽中抽奖现金红包113101元',
                    '150****7057	抽中抽奖现金红包136326元',
                    '187****8782	抽中抽奖现金红包159551元',
                    '159****4003	抽中抽奖现金红包182776元',
                    '138****4665	抽中抽奖现金红包136001元',
                    '136****7993	抽中抽奖现金红包169226元',
                    '186****4477	抽中抽奖现金红包122451元',
                    '137****6630	抽中抽奖现金红包195676元',
                    '135****1786	抽中抽奖现金红包186510元',
                    '186****2795	抽中抽奖现金红包106510元',
                    '182****3712	抽中抽奖现金红包159522元',
                    '159****8804	抽中抽奖现金红包121430元',
                    '151****7380	抽中抽奖现金红包95410元',
                    '177****0830	抽中抽奖现金红包69390元',
                    '153****4301	抽中抽奖现金红包121121元',
                    '156****5671	抽中抽奖现金红包172852元',
                    '136****1103	抽中抽奖现金红包134583元',
                    '158****7515	抽中抽奖现金红包112111元',
                    '153****0227	抽中抽奖现金红包89639元',
                    '155****6397	抽中抽奖现金红包67167元',
                    '139****5603	抽中抽奖现金红包44695元',
                    '180****8451	抽中抽奖现金红包58296元',
                    '130****7455	抽中抽奖现金红包71897元',
                    '136****0105	抽中抽奖现金红包85498元',
                    '152****2962	抽中抽奖现金红包99099元',
                    '186****5257	抽中抽奖现金红包112700元',
                    '138****0462	抽中抽奖现金红包126301元',
                    '133****0869	抽中抽奖现金红包139902元',
                    '139****6266	抽中抽奖现金红包153503元',
                    '158****5458	抽中抽奖现金红包167104元',
                    '133****0839	抽中抽奖现金红包180705元',
                    '136****6569	抽中抽奖现金红包194306元',
                    '135****5566	抽中抽奖现金红包99124元',
                    '157****2688	抽中抽奖现金红包89256元',
                    '139****8360	抽中抽奖现金红包79388元',
                    '139****0809	抽中抽奖现金红包69520元',
                    '135****7428	抽中抽奖现金红包59652元',
                    '131****2307	抽中抽奖现金红包59720元',
                    '153****3969	抽中抽奖现金红包69253元',
                    '189****5440	抽中抽奖现金红包78786元',
                    '130****7483	抽中抽奖现金红包88319元',
                    '150****9099	抽中抽奖现金红包97852元',
                    '131****1863	抽中抽奖现金红包107385元',
                    '138****8656	抽中抽奖现金红包116918元',
                    '139****5255	抽中抽奖现金红包126451元',
                    '134****0167	抽中抽奖现金红包135984元',
                    '138****1965	抽中抽奖现金红包145517元'
                );
                return $list;
                break;
            case 5:
                $list = array(
                    '151****8108	抽中抽奖现金红包272181元',
                    '150****9730	抽中抽奖现金红包268398元',
                    '138****2055	抽中抽奖现金红包279747元',
                    '150****1911	抽中抽奖现金红包302445元',
                    '152****0066	抽中抽奖现金红包264615元',
                    '150****9138	抽中抽奖现金红包275964元',
                    '138****7815	抽中抽奖现金红包226785元',
                    '152****8749	抽中抽奖现金红包234351元',
                    '187****0023	抽中抽奖现金红包204087元',
                    '136****7359	抽中抽奖现金红包284362元',
                    '156****6201	抽中抽奖现金红包221321元',
                    '150****7986	抽中抽奖现金红包310011元',
                    '176****1386	抽中抽奖现金红包245700元',
                    '158****6172	抽中抽奖现金红包260832元',
                    '135****1777	抽中抽奖现金红包211653元',
                    '159****2276	抽中抽奖现金红包207870元',
                    '138****5517	抽中抽奖现金红包215436元',
                    '155****7646	抽中抽奖现金红包261582元',
                    '135****6238	抽中抽奖现金红包294879元',
                    '186****7619	抽中抽奖现金红包230568元',
                    '138****6168	抽中抽奖现金红包283530元',
                    '132****0231	抽中抽奖现金红包248362元',
                    '136****2033	抽中抽奖现金红包238134元',
                    '158****9904	抽中抽奖现金红包332362元',
                    '153****7175	抽中抽奖现金红包223002元',
                    '134****1338	抽中抽奖现金红包249483元',
                    '159****7883	抽中抽奖现金红包260362元',
                    '130****2938	抽中抽奖现金红包200362元',
                    '130****2315	抽中抽奖现金红包308362元',
                    '183****4880	抽中抽奖现金红包296362元',
                    '139****4320	抽中抽奖现金红包356362元',
                    '134****4316	抽中抽奖现金红包320362元',
                    '132****6140	抽中抽奖现金红包212362元',
                    '178****3356	抽中抽奖现金红包368362元',
                    '138****4428	抽中抽奖现金红包291096元',
                    '136****0023	抽中抽奖现金红包344362元',
                    '132****3762	抽中抽奖现金红包140799元',
                    '133****6692	抽中抽奖现金红包253266元',
                    '135****8680	抽中抽奖现金红包181060元',
                    '139****0477	抽中抽奖现金红包219219元',
                    '137****6272	抽中抽奖现金红包287313元',
                    '156****6713	抽中抽奖现金红包257049元',
                    '150****0994	抽中抽奖现金红包380362元',
                    '137****7385	抽中抽奖现金红包392362元',
                    '137****9435	抽中抽奖现金红包272362元',
                    '187****5585	抽中抽奖现金红包306228元',
                    '137****9004	抽中抽奖现金红包236362元',
                    '136****9202	抽中抽奖现金红包241917元',
                    '183****0226	抽中抽奖现金红包224362元',
                    '137****8143	抽中抽奖现金红包298662元'
                );
                return $list;
                break;
            case 6:
                $list = array(
                    '189****7531	抽中抽奖现金红包209378元',
                    '187****9609	抽中抽奖现金红包362001元',
                    '137****1371	抽中抽奖现金红包500496元',
                    '158****3736	抽中抽奖现金红包401571元',
                    '137****6702	抽中抽奖现金红包507091元',
                    '131****1939	抽中抽奖现金红包410251元',
                    '139****8597	抽中抽奖现金红包508201元',
                    '182****5235	抽中抽奖现金红包573041元',
                    '150****5603	抽中抽奖现金红包381786元',
                    '187****2219	抽中抽奖现金红包358906元',
                    '182****5796	抽中抽奖现金红包547381元',
                    '155****8962	抽中抽奖现金红包579636元',
                    '150****0320	抽中抽奖现金红包467521元',
                    '150****8950	抽中抽奖现金红包469021元',
                    '130****5771	抽中抽奖现金红包228069元',
                    '159****6032	抽中抽奖现金红包520281元',
                    '135****5415	抽中抽奖现金红包394976元',
                    '185****0738	抽中抽奖现金红包348811元',
                    '186****1176	抽中抽奖现金红包302833元',
                    '151****1305	抽中抽奖现金红包340215元',
                    '175****5652	抽中抽奖现金红包526876元',
                    '138****0857	抽中抽奖现金红包449431元',
                    '130****8258	抽中抽奖现金红包527791元',
                    '189****1888	抽中抽奖现金红包546661元',
                    '152****8603	抽中抽奖现金红包265451元',
                    '182****9118	抽中抽奖现金红包388381元',
                    '132****9398	抽中抽奖现金红包460926元',
                    '137****0337	抽中抽奖现金红包375191元',
                    '159****3677	抽中抽奖现金红包441141元',
                    '136****2267	抽中抽奖现金红包427951元',
                    '187****5170	抽中抽奖现金红包586231元',
                    '152****3285	抽中抽奖现金红包540066元',
                    '187****1870	抽中抽奖现金红包474116元',
                    '159****3853	抽中抽奖现金红包566446元',
                    '177****5361	抽中抽奖现金红包487306元',
                    '159****8297	抽中抽奖现金红包434546元',
                    '138****3756	抽中抽奖现金红包592826元',
                    '151****2840	抽中抽奖现金红包355406元',
                    '133****0488	抽中抽奖现金红包335621元',
                    '189****7696	抽中抽奖现金红包246760元',
                    '151****0817	抽中抽奖现金红包488611元',
                    '132****0508	抽中抽奖现金红包414761元',
                    '139****3921	抽中抽奖现金红包421356元',
                    '137****8488	抽中抽奖现金红包553256元',
                    '150****6689	抽中抽奖现金红包480711元',
                    '135****5142	抽中抽奖现金红包368596元',
                    '152****7697	抽中抽奖现金红包284142元',
                    '159****8180	抽中抽奖现金红包533471元',
                    '131****6688	抽中抽奖现金红包559851元',
                    '133****1870	抽中抽奖现金红包447736元',
                    '137****1566	抽中抽奖现金红包493901元',
                    '185****2136	抽中抽奖现金红包429841元',
                    '158****3175	抽中抽奖现金红包342216元',
                    '183****8673	抽中抽奖现金红包454331元',
                    '151****6222	抽中抽奖现金红包408166元',
                    '151****2437	抽中抽奖现金红包321524元',
                    '138****7395	抽中抽奖现金红包513686元'
                );
                return $list;
                break;
            case 888:
                $list = array(
                    '130****6565	抽中抽奖现金红包713740元',
                    '130****0570	抽中抽奖现金红包671230元',
                    '130****9062	抽中抽奖现金红包600380元',
                    '131****1162	抽中抽奖现金红包777505元',
                    '132****6010	抽中抽奖现金红包720825元',
                    '133****5504	抽中抽奖现金红包628720元',
                    '133****5507	抽中抽奖现金红包642890元',
                    '134****1431	抽中抽奖现金红包564955元',
                    '135****4516	抽中抽奖现金红包635805元',
                    '135****5218	抽中抽奖现金红包855440元',
                    '135****4306	抽中抽奖现金红包557870元',
                    '135****9352	抽中抽奖现金红包834185元',
                    '136****2575	抽中抽奖现金红包756250元',
                    '137****1639	抽中抽奖现金红包692485元',
                    '138****6903	抽中抽奖现金红包749165元',
                    '138****7513	抽中抽奖现金红包742080元',
                    '138****2155	抽中抽奖现金红包784590元',
                    '138****2656	抽中抽奖现金红包593295元',
                    '139****6661	抽中抽奖现金红包607465元',
                    '150****6254	抽中抽奖现金红包664145元',
                    '150****1600	抽中抽奖现金红包529530元',
                    '150****7629	抽中抽奖现金红包734995元',
                    '151****6870	抽中抽奖现金红包678315元',
                    '153****3876	抽中抽奖现金红包621635元',
                    '153****8603	抽中抽奖现金红包649975元',
                    '155****9483	抽中抽奖现金红包550785元',
                    '155****9943	抽中抽奖现金红包862525元',
                    '156****8120	抽中抽奖现金红包791675元',
                    '158****5633	抽中抽奖现金红包515360元',
                    '159****5363	抽中抽奖现金红包536615元',
                    '159****3550	抽中抽奖现金红包543700元',
                    '159****9368	抽中抽奖现金红包798760元',
                    '159****7480	抽中抽奖现金红包699570元',
                    '159****6131	抽中抽奖现金红包586210元',
                    '173****7625	抽中抽奖现金红包869610元',
                    '176****5793	抽中抽奖现金红包706655元',
                    '182****0839	抽中抽奖现金红包522445元',
                    '183****8939	抽中抽奖现金红包572040元',
                    '185****2672	抽中抽奖现金红包727910元',
                    '186****2280	抽中抽奖现金红包614550元',
                    '186****3383	抽中抽奖现金红包770420元',
                    '187****7963	抽中抽奖现金红包763335元',
                    '187****6393	抽中抽奖现金红包657060元',
                    '188****0716	抽中抽奖现金红包876695元',
                    '191****0468	抽中抽奖现金红包579125元',
                    '193****8638	抽中抽奖现金红包685400元',
                    '133****9057	抽中抽奖现金红包423255元',
                    '133****3010	抽中抽奖现金红包820015元',
                    '137****7978	抽中抽奖现金红包479935元',
                    '137****2501	抽中抽奖现金红包805845元',
                    '138****5962	抽中抽奖现金红包458680元',
                    '138****2090	抽中抽奖现金红包501190元',
                    '138****2168	抽中抽奖现金红包451595元',
                    '138****7813	抽中抽奖现金红包465765元',
                    '139****7070	抽中抽奖现金红包472850元',
                    '139****1092	抽中抽奖现金红包508275元',
                    '139****1144	抽中抽奖现金红包430340元',
                    '139****2240	抽中抽奖现金红包416170元',
                    '150****2729	抽中抽奖现金红包494105元',
                    '151****2565	抽中抽奖现金红包487020元',
                    '153****7083	抽中抽奖现金红包841270元',
                    '156****1776	抽中抽奖现金红包444510元',
                    '185****3298	抽中抽奖现金红包812930元',
                    '186****9989	抽中抽奖现金红包437425元',
                    '186****5850	抽中抽奖现金红包827100元',
                    '188****5549	抽中抽奖现金红包848355元'
                );
                return $list;
                break;
            case 999:
                $list = array(
                    '151****3001	抽中抽奖现金红包90314元',
                    '155****7868	抽中抽奖现金红包32317元',
                    '137****6040	抽中抽奖现金红包24305元',
                    '132****5838	抽中抽奖现金红包20299元',
                    '151****8375	抽中抽奖现金红包96323元',
                    '155****3033	抽中抽奖现金红包34320元',
                    '139****8505	抽中抽奖现金红包14574元',
                    '153****5706	抽中抽奖现金红包6271元',
                    '134****7986	抽中抽奖现金红包54350元',
                    '150****1868	抽中抽奖现金红包10284元',
                    '155****3596	抽中抽奖现金红包9954元',
                    '150****3256	抽中抽奖现金红包4275元',
                    '155****1106	抽中抽奖现金红包16293元',
                    '135****0391	抽中抽奖现金红包56353元',
                    '150****3732	抽中抽奖现金红包45588元',
                    '139****1209	抽中抽奖现金红包89514元',
                    '182****6657	抽中抽奖现金红包4572元',
                    '132****9893	抽中抽奖现金红包46631元',
                    '138****7654	抽中抽奖现金红包22302元',
                    '151****2008	抽中抽奖现金红包6278元',
                    '181****9150	抽中抽奖现金红包66588元',
                    '158****9169	抽中抽奖现金红包12287元',
                    '150****4558	抽中抽奖现金红包28851元',
                    '186****9633	抽中抽奖现金红包18568元',
                    '182****5587	抽中抽奖现金红包40329元',
                    '134****1920	抽中抽奖现金红包14290元',
                    '188****9543	抽中抽奖现金红包44335元',
                    '138****6978	抽中抽奖现金红包18296元',
                    '132****7698	抽中抽奖现金红包8281元',
                    '138****0165	抽中抽奖现金红包4556元',
                    '158****7133	抽中抽奖现金红包62332元',
                    '132****9999	抽中抽奖现金红包96338元',
                    '138****1366	抽中抽奖现金红包48341元',
                    '186****0968	抽中抽奖现金红包50344元',
                    '183****7833	抽中抽奖现金红包56561元',
                    '182****9165	抽中抽奖现金红包89514元',
                    '181****1113	抽中抽奖现金红包4573元',
                    '186****9646	抽中抽奖现金红包8851元',
                    '159****8548	抽中抽奖现金红包6651元',
                    '130****4399	抽中抽奖现金红包4576元',
                    '135****5396	抽中抽奖现金红包28311元',
                    '150****3271	抽中抽奖现金红包26308元',
                    '136****7526	抽中抽奖现金红包92141元',
                    '139****3879	抽中抽奖现金红包89121元',
                    '151****6711	抽中抽奖现金红包89912元',
                    '152****8047	抽中抽奖现金红包56461元',
                    '166****1481	抽中抽奖现金红包38326元',
                    '139****8755	抽中抽奖现金红包52347元',
                    '136****4351	抽中抽奖现金红包56556元',
                    '183****6183	抽中抽奖现金红包26221元'
                );
                return $list;
                break;
            default:
                $list = array();
                return $list;
                break;
        }
    }



}
